## l Loading csv files

In [ ]:
# medthod 1: load from a  locate file on your computer
df = pd.read_csv("datasets/sales_data.csv")
print("datasets loaded successfully")

datasets loaded successfully

In [5]:
import pandas as pd 
# Method 1: Load from a local file on your computer

In [50]:
# medthod 2: load with  extra option ( we'll explain these)
de =pd.read_csv("datasets\sales_data.csv",sep=",", encoding="utf-8")
print("data loaded successfully")

data loaded successfully

## 2.loading Excel File

In [8]:
# Load an Excel file (.xlsx or .xls) 
df = pd.read_excel("datasets\student_grades.xlsx") 
print("Excel file loaded successfully!")

Excel file loaded successfully!

In [10]:
# Load  specific worksheets from an Excel file
df = pd.read_excel("datasets\monthly_reports.xlsx",sheet_name="January") 
print("Excel file loaded successfully!")

Excel file loaded successfully!

fixing loading error

In [11]:
import os
if os.path.exists("sales_data.csv"):
   sales=pd.read_csv("sales_data.csv")
   print("loading successfully")
else:
    print("file path not found")

file path not found

2. exploring  datafram

In [12]:
#  A load sales data
df= pd.read_csv("datasets\sales_data.csv")
print("loaded succssfully")

loaded succssfully

In [13]:
print("show the first 5 row")
df.head(5)

show the first 5 row

         Date    Product  Category  Price  Quantity Customer_Type
0  2024-02-11  Croissant      Food   2.87         5           New
1  2024-01-07      Bagel      Food   2.40         5           New
2  2024-01-29      Mocha  Beverage   5.32         2           New
3  2024-02-14  Americano  Beverage   4.25         2           New
4  2024-02-21      Mocha  Beverage   3.15         1       Regular

In [18]:
print("last 5 row")
df.tail(5)

last 5 row

          Date     Product  Category  Price  Quantity Customer_Type
25  2024-02-10  Cappuccino  Beverage   2.89         3       Regular
26  2024-03-08      Muffin      Food   2.99         4           New
27  2024-03-29    Espresso  Beverage   5.45         5           New
28  2024-02-20    Espresso  Beverage   4.32         1           New
29  2024-03-13   Croissant      Food   3.03         5           New

understand your data structer

In [17]:
print("datasets information")
df.info()

datasets information
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           30 non-null     object
 1   Product        30 non-null     object
 2   Category       30 non-null     object
 3   Price          30 non-null     float64
 4   Quantity       30 non-null     int64
 5   Customer_Type  30 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.5+ KB

In [ ]:
#dataset shape
df.shape

dataset shape

(30, 6)

In [20]:
print("number of colums")
df.shape[0]

number of colums

30

In [21]:
#print colums
df.columns

Index(['Date', 'Product', 'Category', 'Price', 'Quantity', 'Customer_Type'], dtype='object')

In [22]:
df.columns.tolist()# tolist convert in to a single list

['Date', 'Product', 'Category', 'Price', 'Quantity', 'Customer_Type']

In [ ]:
get the summary statistice

In [ ]:
# show summary statistics
df.describe() # get statistics for numerical colums only

           Price   Quantity
count  30.000000  30.000000
mean    3.750667   3.300000
std     0.920858   1.556964
min     2.400000   1.000000
25%     3.000000   2.000000
50%     3.660000   4.000000
75%     4.305000   5.000000
max     5.490000   5.000000

In [ ]:
print("all column statistics")

##

2.3 select data

In [ ]:
# select one column
product_cilumn=df["Product"]
product_cilumn.head(5
                    )

0    Croissant
1        Bagel
2        Mocha
3    Americano
4        Mocha
Name: Product, dtype: object

In [26]:
df.head(5)

         Date    Product  Category  Price  Quantity Customer_Type
0  2024-02-11  Croissant      Food   2.87         5           New
1  2024-01-07      Bagel      Food   2.40         5           New
2  2024-01-29      Mocha  Beverage   5.32         2           New
3  2024-02-14  Americano  Beverage   4.25         2           New
4  2024-02-21      Mocha  Beverage   3.15         1       Regular

In [30]:
#select multiple column
product_and_price= df[["Product","Price"]]
product_and_price.head()

     Product  Price
0  Croissant   2.87
1      Bagel   2.40
2      Mocha   5.32
3  Americano   4.25
4      Mocha   3.15

In [55]:
# medthod 3 select columns using dot notation
Prices= df.Price
Prices.head(5)

0    2.87
1    2.40
2    5.32
3    4.25
4    3.15
Name: Price, dtype: float64

Select Row

Using iloc

In [33]:
first_row=df.iloc[0]
first_row

Date             2024-02-11
Product           Croissant
Category               Food
Price                  2.87
Quantity                  5
Customer_Type           New
Name: 0, dtype: object

In [34]:
first_3_rows=df.iloc[0:3]
first_3_rows

         Date    Product  Category  Price  Quantity Customer_Type
0  2024-02-11  Croissant      Food   2.87         5           New
1  2024-01-07      Bagel      Food   2.40         5           New
2  2024-01-29      Mocha  Beverage   5.32         2           New

In [ ]:
using. ioc[] label-based select

In [35]:
first_rows=df.loc[0]
first_row

Date             2024-02-11
Product           Croissant
Category               Food
Price                  2.87
Quantity                  5
Customer_Type           New
Name: 0, dtype: object

In [64]:
first_5=df.loc[0:5, ["Product","Price","Quantity"]]
first_5

     Product  Price  Quantity
0  Croissant   2.87         5
1      Bagel   2.40         5
2      Mocha   5.32         2
3  Americano   4.25         2
4      Mocha   3.15         1
5  Americano   5.48         4

In [ ]:
filtering data

In [38]:
#filler 1: find the expensive items (price> $4.00)
expensive_items= df[df["Price"]>4.0]
expensive_items.head(5)

         Date    Product  Category  Price  Quantity Customer_Type
2  2024-01-29      Mocha  Beverage   5.32         2           New
3  2024-02-14  Americano  Beverage   4.25         2           New
5  2024-02-27  Americano  Beverage   5.48         4           New
6  2024-02-01      Latte  Beverage   4.39         5       Regular
7  2024-01-10  Americano  Beverage   5.49         5           New

In [59]:
# show detail where customer type is regular
regular_customers= df[df["Customer_Type"]=="regular"]
regular_customers.head(5)

Empty DataFrame
Columns: [Date, Product, Category, Price, Quantity, Customer_Type]
Index: []

In [47]:
# Filter 3: Combine conditions with & (AND)
expensive_beverages = df[(df['Price'] > 4.00) & (df['Category'] == 'Beverage')]
print(" Expensive beverages:")
expensive_beverages.head(5)

 Expensive beverages:

         Date    Product  Category  Price  Quantity Customer_Type
2  2024-01-29      Mocha  Beverage   5.32         2           New
3  2024-02-14  Americano  Beverage   4.25         2           New
5  2024-02-27  Americano  Beverage   5.48         4           New
6  2024-02-01      Latte  Beverage   4.39         5       Regular
7  2024-01-10  Americano  Beverage   5.49         5           New

In [ ]:
expensive_foods= df[(df["Price",]>3) & (df["Category"]=="Beverages")]

In [ ]:
tech_gadgets= pd.